<%@ Page Title="" Language="C#" MasterPageFile="MasterRestoran.master" AutoEventWireup="true" CodeFile="Proekt.aspx.cs" Inherits="Proekt" %>

<asp:Content ID="Content1" ContentPlaceHolderID="head" Runat="Server">
</asp:Content>
<asp:Content ID="Content2" ContentPlaceHolderID="ContentPlaceHolder1" Runat="Server">
<img src="Images/RestoranRez.jpg" />
<br />
<h1 class="naslov">Опис на апликацијата за резервации во ресторан</h1>
<p class="appOpis">Проектот е работен за предметот Интернет Техонологии. Главна задача е да се овозможи систем за
резервација во ресторани. За таа цел направив база на податоци со три табели:Маси,Ресторани и Резервации.
 Табелата маси содржи идентификатор за маса и број на седишта. Табелата Ресторани содржи идентификатор и име на ресторан, а табелата
 резервации е во релација со табелите маси и ресторани и има додатни контакт инфорамции. Апликацијата е работена во asp.net технологија. Содржи серверски контроли и има валицадија на влезните податоци.
  Истотака листата на ресторани се полни од базата, што значи има пример за интеракција на базата со .net контролите. Главниот сегмент на резевациите е тоа што
  се проверува дали за тековниот ден во избраниот ресторан има доволно место, ако нема се испишува соодветната порака. Направено е и грешките што ги дава
  серверот да се прикажуваат во статусот</p>
  <div id="slikiProekt">
    <img src="Images/Asp.jpg" /> <img src="Images/SqlSR.jpg" />
    </div>
</asp:Content>

